Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainGeneralProblem Property
 The chain formed by these curve elements cannot be processed and will be ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainGeneralProblem { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainGeneralProblem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainGeneralProblem {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainGeneralProblem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace